# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [19]:
# Import pandas
import pandas as pd
import numpy as np

In [5]:
# Create a series of three different colours
colors = pd.Series(('Red', 'Blue', 'Green'))

In [6]:
# View the series of different colours
colors

0      Red
1     Blue
2    Green
dtype: object

In [8]:
# Create a series of three different car types and view it
types = pd.Series(['sedan', 'suv', 'hatchbacj'])
types

0        sedan
1          suv
2    hatchbacj
dtype: object

In [13]:
# Combine the Series of cars and colours into a DataFrame
cars_custom = pd.DataFrame({
  'colors': colors,
  'types': types
})
cars_custom

  colors      types
0    Red      sedan
1   Blue        suv
2  Green  hatchbacj

In [14]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
cars = pd.read_csv("./car-sales.csv")
cars.head(2)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [15]:
# Export the DataFrame you created to a .csv file
cars.to_csv('gg-sales.csv')

In [16]:
# Find the different datatypes of the car data DataFrame
cars.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [17]:
# Describe your current car sales DataFrame using describe()
cars.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [18]:
# Get information about your DataFrame using info()
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

What does it show you?

In [20]:
# Create a Series of different numbers and find the mean of them
np.mean(pd.Series([2,5,2,3]))

3.0

In [21]:
# Create a Series of different numbers and find the sum of them
pd.Series([2,5,2,3]).sum()

12

In [22]:
# List out all the column names of the car sales DataFrame
cars.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [26]:
# Find the length of the car sales DataFrame
len(cars)

10

In [27]:
# Show the first 5 rows of the car sales DataFrame
cars[:5]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [28]:
# Show the first 7 rows of the car sales DataFrame
cars[:7]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [32]:
# Show the bottom 5 rows of the car sales DataFrame
cars[-5:]

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [33]:
# Use .loc to select the row at index 3 of the car sales DataFrame
cars.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [34]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
cars.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

RangeIndex(start=0, stop=10, step=1)

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [36]:
# Select the "Odometer (KM)" column from the car sales DataFrame
cars['Odometer (KM)']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [37]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
cars['Odometer (KM)'].mean()

78601.4

In [40]:
# Select the rows with over 100,000 kilometers on the Odometer
cars[cars['Odometer (KM)'] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [42]:
cars.head(2)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

In [48]:
cars.loc[cars['Doors'] == 4, ['Price', 'Make', 'Doors']]

       Price    Make  Doors
0  $4,000.00  Toyota      4
1  $5,000.00   Honda      4
4  $3,500.00  Nissan      4
5  $4,500.00  Toyota      4
6  $7,500.00   Honda      4
7  $7,000.00   Honda      4
8  $6,250.00  Toyota      4
9  $9,700.00  Nissan      4

In [41]:
# Create a crosstab of the Make and Doors columns

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

In [24]:
# Group columns of the car sales DataFrame by the Make column and find the average

In [25]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline

In [26]:
# Create a histogram of the Odometer column using hist()

In [27]:
# Try to plot the Price column using plot()

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string column to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [28]:
# Remove the punctuation from price column
# use str.replace("[\$\,\.]", "")
# refer the link to study Punctuation replcemenet https://blog.enterprisedna.co/python-remove-punctuation-from-string/

In [29]:
# Check the changes to the price column

In [30]:
# Remove the two extra zeros at the end of the price column

In [31]:
# Check the changes to the Price column

In [32]:
# Change the datatype of the Price column to integers

In [33]:
# Lower the strings of the Make column

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [34]:
# Make lowering the case of the Make column permanent

In [35]:
# Check the car sales DataFrame

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.